views/layouts/main.php

SELECT `modulo`.`id` AS `mid`, `modulo`.`descripcion` FROM `usuarios` INNER JOIN `perfil` ON perfil.id = usuarios.id_perfil INNER JOIN `accesos` ON accesos.id_pefil = perfil.id INNER JOIN `menus` ON menus.id = accesos.id_menu INNER JOIN `modulo` ON modulo.id = menus.id_modulo WHERE usuarios.id=1 and accesos.estado=1 and  modulo.estado=1 and menus.visible=1 GROUP BY `modulo`.`id`, `modulo`.`descripcion`
---
            if(!\Yii::$app->user->can('admin'))
            {

                $modulos=Usuarios::find()
                                    ->select('modulo.id mid,modulo.descripcion')
                                    ->innerJoin('perfil','perfil.id = usuarios.id_perfil')
                                    ->innerJoin('accesos','accesos.id_pefil = perfil.id')
                                    ->innerJoin('menus','menus.id = accesos.id_menu')
                                    ->innerJoin('modulo','modulo.id = menus.id_modulo')
                                    ->where('usuarios.id=:user_id and accesos.estado=1 and  modulo.estado=1 and menus.visible=1',[':user_id'=>Yii::$app->user->identity->id])
                                    ->groupBy('modulo.id,modulo.descripcion')
                                    ->all();

SELECT `menus`.`descripcion`, `menus`.`ruta` FROM `usuarios` INNER JOIN `perfil` ON perfil.id = usuarios.id_perfil INNER JOIN `accesos` ON accesos.id_pefil = perfil.id INNER JOIN `menus` ON menus.id = accesos.id_menu WHERE usuarios.id=1 and menus.estado=1 and accesos.estado=1 and menus.id_modulo='1' and menus.visible=1
---

               // var_dump($modulo->descripcion);die;

                $menus= Usuarios::find()
                                    ->select('menus.descripcion, menus.ruta')
                                    ->innerJoin('perfil','perfil.id = usuarios.id_perfil')
                                    ->innerJoin('accesos','accesos.id_pefil = perfil.id')
                                    ->innerJoin('menus','menus.id = accesos.id_menu')
                                    ->where('usuarios.id=:user_id and menus.estado=1 and accesos.estado=1 and menus.id_modulo=:id_modulo and menus.visible=1',[':user_id'=>Yii::$app->user->identity->id,':id_modulo'=>$modulo->mid])
                                    ->all();