models/Usuarios.php

SELECT * FROM `usuarios` WHERE `id`=1
---
    public static function findIdentity($id){
		return static::findOne($id);

SELECT * FROM `usuarios` WHERE password='123456' and username='admin' and estado=1
---
	public static function findByUsername($username){
		//return self::findOne(['username'=>$username]);
            return static::find()->where('username=:username and estado=1',[':username' => $username])->one();